balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128DA110.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1W1ADRL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1W1ADRL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="W1ADR0" edc:desc="" edc:mask="0x1" edc:name="W1ADR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR1" edc:desc="" edc:mask="0x1" edc:name="W1ADR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR2" edc:desc="" edc:mask="0x1" edc:name="W1ADR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR3" edc:desc="" edc:mask="0x1" edc:name="W1ADR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR4" edc:desc="" edc:mask="0x1" edc:name="W1ADR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR5" edc:desc="" edc:mask="0x1" edc:name="W1ADR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR6" edc:desc="" edc:mask="0x1" edc:name="W1ADR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR7" edc:desc="" edc:mask="0x1" edc:name="W1ADR7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR8" edc:desc="" edc:mask="0x1" edc:name="W1ADR8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR9" edc:desc="" edc:mask="0x1" edc:name="W1ADR9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR10" edc:desc="" edc:mask="0x1" edc:name="W1ADR10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR11" edc:desc="" edc:mask="0x1" edc:name="W1ADR11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR12" edc:desc="" edc:mask="0x1" edc:name="W1ADR12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR13" edc:desc="" edc:mask="0x1" edc:name="W1ADR13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR14" edc:desc="" edc:mask="0x1" edc:name="W1ADR14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR15" edc:desc="" edc:mask="0x1" edc:name="W1ADR15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="G1W1ADRH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="G1W1ADRH" edc:nzwidth="16" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="W1ADR16" edc:desc="" edc:mask="0x1" edc:name="W1ADR16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR17" edc:desc="" edc:mask="0x1" edc:name="W1ADR17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR18" edc:desc="" edc:mask="0x1" edc:name="W1ADR18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR19" edc:desc="" edc:mask="0x1" edc:name="W1ADR19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR20" edc:desc="" edc:mask="0x1" edc:name="W1ADR20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR21" edc:desc="" edc:mask="0x1" edc:name="W1ADR21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR22" edc:desc="" edc:mask="0x1" edc:name="W1ADR22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W1ADR23" edc:desc="" edc:mask="0x1" edc:name="W1ADR23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="G1W2ADRL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="G1W2ADRL" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="W2ADR0" edc:desc="" edc:mask="0x1" edc:name="W2ADR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR1" edc:desc="" edc:mask="0x1" edc:name="W2ADR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR2" edc:desc="" edc:mask="0x1" edc:name="W2ADR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR3" edc:desc="" edc:mask="0x1" edc:name="W2ADR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR4" edc:desc="" edc:mask="0x1" edc:name="W2ADR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR5" edc:desc="" edc:mask="0x1" edc:name="W2ADR5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR6" edc:desc="" edc:mask="0x1" edc:name="W2ADR6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR7" edc:desc="" edc:mask="0x1" edc:name="W2ADR7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR8" edc:desc="" edc:mask="0x1" edc:name="W2ADR8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR9" edc:desc="" edc:mask="0x1" edc:name="W2ADR9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR10" edc:desc="" edc:mask="0x1" edc:name="W2ADR10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR11" edc:desc="" edc:mask="0x1" edc:name="W2ADR11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR12" edc:desc="" edc:mask="0x1" edc:name="W2ADR12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR13" edc:desc="" edc:mask="0x1" edc:name="W2ADR13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR14" edc:desc="" edc:mask="0x1" edc:name="W2ADR14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR15" edc:desc="" edc:mask="0x1" edc:name="W2ADR15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="G1W2ADRH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="G1W2ADRH" edc:nzwidth="16" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="W2ADR16" edc:desc="" edc:mask="0x1" edc:name="W2ADR16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR17" edc:desc="" edc:mask="0x1" edc:name="W2ADR17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR18" edc:desc="" edc:mask="0x1" edc:name="W2ADR18" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR19" edc:desc="" edc:mask="0x1" edc:name="W2ADR19" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR20" edc:desc="" edc:mask="0x1" edc:name="W2ADR20" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR21" edc:desc="" edc:mask="0x1" edc:name="W2ADR21" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR22" edc:desc="" edc:mask="0x1" edc:name="W2ADR22" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="W2ADR23" edc:desc="" edc:mask="0x1" edc:name="W2ADR23" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1PUW" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1PUW" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PUW" edc:desc="" edc:mask="0x7ff" edc:name="PUW" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PUW0" edc:desc="" edc:mask="0x1" edc:name="PUW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW1" edc:desc="" edc:mask="0x1" edc:name="PUW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW2" edc:desc="" edc:mask="0x1" edc:name="PUW2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW3" edc:desc="" edc:mask="0x1" edc:name="PUW3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW4" edc:desc="" edc:mask="0x1" edc:name="PUW4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW5" edc:desc="" edc:mask="0x1" edc:name="PUW5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW6" edc:desc="" edc:mask="0x1" edc:name="PUW6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW7" edc:desc="" edc:mask="0x1" edc:name="PUW7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW8" edc:desc="" edc:mask="0x1" edc:name="PUW8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW9" edc:desc="" edc:mask="0x1" edc:name="PUW9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUW10" edc:desc="" edc:mask="0x1" edc:name="PUW10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="G1PUH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="G1PUH" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PUH" edc:desc="" edc:mask="0x7ff" edc:name="PUH" edc:nzwidth="11"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PUH0" edc:desc="" edc:mask="0x1" edc:name="PUH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH1" edc:desc="" edc:mask="0x1" edc:name="PUH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH2" edc:desc="" edc:mask="0x1" edc:name="PUH2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH3" edc:desc="" edc:mask="0x1" edc:name="PUH3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH4" edc:desc="" edc:mask="0x1" edc:name="PUH4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH5" edc:desc="" edc:mask="0x1" edc:name="PUH5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH6" edc:desc="" edc:mask="0x1" edc:name="PUH6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH7" edc:desc="" edc:mask="0x1" edc:name="PUH7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH8" edc:desc="" edc:mask="0x1" edc:name="PUH8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH9" edc:desc="" edc:mask="0x1" edc:name="PUH9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PUH10" edc:desc="" edc:mask="0x1" edc:name="PUH10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
